Revit 2027 API
ParameterTypeId.StairsRailingConnection Property
 "Rail Connections"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsRailingConnection { get; }
Public Shared ReadOnly Property StairsRailingConnection As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsRailingConnection {
	ForgeTypeId^ get ();
}
static member StairsRailingConnection : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace